Repository: JuezUN/INGInious-containers
Catalog: grading/uncode/lang/*/LC_MESSAGES/messages.po
Languages: es

source: Your code exceeded the output limit
es: El código excedió el límite de salida estándar

source: Your code finished successfully. Check your output below .
es: El código finalizó satisfactoriamente. Revise el resultado en la parte de abajo .

source: Your code did not run successfully
es: El código no se ejecutó satisfactoriamente

source: Long output, it was reduced.
es: Salida estándar muy grande, fue reducida.

source: Your code did not run successfully: <strong>%s</strong>, check the error below.
es: El código no se ejecutó satisfactoriamente: <strong>%s</strong>, revise el error en la parte de abajo.

source: Failed downloading dataset, make sure the container has access to Internet.
es: Falló descargando el dataset, asegúrese que el contenedor tiene acceso a Internet.

source: Unexpected error while parsing the notebook. Check that your notebook runs correctly and try again.
es: Error inesperado mientras se analizaba el notebook. Revise que el notebook se ejecute correctamente y vuélvalo a intentar.

source: <br><strong>{}:</strong> There was an error while running your notebook: <br><pre>{}</pre><br>
es: <br><strong>{}:</strong> Hubo un error mientras se ejecutaba el notebook: <br><pre>{}</pre><br>

source: - Case {}: {}
es: - Caso {}: {}

source: Expand test results
es: Expandir resultados del test

source: Expand test results (only for staff)
es: Expandir resultados del test (solo para staff)

source: <br><strong>Custom feedback:</strong><br><pre>{custom_feedback}</pre>
es: <br><strong>Retroalimentación personalizada:</strong><br><pre>{custom_feedback}</pre>

source: <br><strong>Output difference:</strong><pre>{case_output_diff}</pre><br>
es: <br><strong>Diferencia en la salida estándar:</strong><pre>{case_output_diff}</pre><br>

source: <ul class="list_disc" style="font-size:12px; list-style-type: square;"><li> <strong>Case {case_id}:</strong><a class="btn btn-default btn-link btn-xs" role="button" data-toggle="collapse" href="#{case_panel_id}" aria-expanded="false"aria-controls="{case_panel_id}">Show debug info</a> <div class="collapse" id="{case_panel_id}">{debug_info}</div></li></ul>
es: <ul class="list_disc" style="font-size:12px; list-style-type: square;"><li> <strong>Caso {case_id}:</strong><a class="btn btn-default btn-link btn-xs" role="button" data-toggle="collapse" href="#{case_panel_id}" aria-expanded="false"aria-controls="{case_panel_id}">Mostrar información de depuración</a> <div class="collapse" id="{case_panel_id}">{debug_info}</div></li></ul>

source: <ul class="list_disc" style="font-size:12px; list-style-type: square;"><li> <strong>Case {case_id}:</strong><a class="btn btn-default btn-link btn-xs" role="button" data-toggle="collapse" href="#{case_panel_id}" aria-expanded="false"aria-controls="{case_panel_id}">Show debug info (only for staff)</a> <div class="collapse" id="{case_panel_id}">{debug_info}</div></li></ul>
es: <ul class="list_disc" style="font-size:12px; list-style-type: square;"><li> <strong>Caso {case_id}:</strong><a class="btn btn-default btn-link btn-xs" role="button" data-toggle="collapse" href="#{case_panel_id}" aria-expanded="false"aria-controls="{case_panel_id}">Mostrar información de depuración (solo para staff)</a> <div class="collapse" id="{case_panel_id}">{debug_info}</div></li></ul>

source: <strong>Executed code:</strong><pre class="language-python"><code class="language-python" data-language="python">{case_code}</code></pre><script>highlight_code();</script>
es: <strong>Código ejecutado:</strong><pre class="language-python"><code class="language-python" data-language="python">{case_code}</code></pre><script>highlight_code();</script>

source: Toggle diff
es: Alternar panel de diferencias

source: <p>Input preview: {title_input}</p> <pre class="input-area" id="{block_id}-input">{input_text}</pre> <div id="{title_input}_download_link"></div> <script>createDownloadLink("{title_input}");</script>
es: <p>Vista previa de la entrada: {title_input}</p> <pre class="input-area" id="{block_id}-input">{input_text}</pre> <div id="{title_input}_download_link"></div> <script>createDownloadLink("{title_input}");</script>

source: <p>Custom feedback</p><pre>{custom_feedback}</pre><br>
es: <p>Retroalimentación personalizada</p><pre>{custom_feedback}</pre><br>

source: @@ Diff is too big and was clipped. The error might be in last lines.
es: @@ La diferencia es muy grande y fue recortada. El error puede estar en la últimas líneas.

source: **Compilation error**:
es: **Error de compilación**:

source: The memory limit was exceeded during compilation.
es: La memoria límite fue excedida en tiempo de compilación.

source: The time limit was exceeded during compilation.
es: El tiempo límite fue excedido en tiempo de compilación.

source: Compilation failed.
es: La compilación falló.

source: Unhandled grader result:
es: Resultado no manejado:

source: Factory does not exist:
es: El Factory no existe:
